ede.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="urn:GRID_GEOData_Service">
<SOAP-ENV:Body>
<tns:DataSearch xmlns:tns="urn:GRID_GEOData_Service">
<DataQuery xsi:type="tns:DataRequest">
<ID xsi:type="xsd:int">1</ID>
<CountryID xsi:type="xsd:string">UA</CountryID>
<region xsi:type="xsd:string">all</region>
<date_period xsi:type="xsd:string">1993:2013</date_period>
</DataQuery>
</tns:DataSearch>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>